[
    {
        "name": "Tijd",
        "type": "DATE",
        "mode": "REQUIRED",
        "description": "Date of submission from the applicable revenue. Should be unique."
    },
    {
        "name": "pin",
        "type": "FLOAT",
        "description": "Float inserted revenue which is on a pin basis on the given day."
    },
    {
        "name": "cash",
        "type": "FLOAT",
        "description": "Float inserted revenue which is on a cash basis on the given day."
    },
    {
        "name": "ideal",
        "type": "FLOAT",
        "description": "Float inserted revenue which is on an iDEAL basis on the given day."
    },
    {
        "name": "thuis",
        "type": "FLOAT",
        "description": "Float inserted revenue which is coming from Thuisbezorgd on the given day."
    },
    {
        "name": "total_am",
        "type": "FLOAT",
        "description": "Float inserted revenue which is coming from a combination of pin, cash, iDEAL, and Thuisbezorgd on the given day."
    },
    {
        "name": "n_pin",
        "type": "INTEGER",
        "description": "Integer inserted that resembled the amount of pin cases on the given day."
    },
    {
        "name": "n_cash",
        "type": "INTEGER",
        "description": "Integer inserted amount of cash cases on the given day."
    },
    {
        "name": "n_ideal",
        "type": "INTEGER",
        "description": "Integer inserted the number of iDEAL cases on the given day."
    },
    {
        "name": "n_thuis",
        "type": "INTEGER",
        "description": "Integer inserted the amount of Thuisbezorgd orders on the given day."
    },
    {
        "name": "n_total",
        "type": "INTEGER",
        "description": "Integer inserted for replicating the amount of pin, cash, iDEAL, and Thuisbezorgd cases on the given day."
    },
    {
        "name": "avg_pin",
        "type": "FLOAT",
        "description": "The average pin amount by dividing the total amount of pin cases by the number of pin transactions done on that particular date."
    },
    {
        "name": "avg_cash",
        "type": "FLOAT",
        "description": "The average cash amount by dividing the total amount of cash by the number of cash transactions done on that particular date."
    },
    {
        "name": "avg_ideal",
        "type": "FLOAT",
        "description": "The average iDEAL amount by dividing the total amount of iDEAL cases by the number of iDEAL transactions done on that particular date."
    },
    {
        "name": "avg_thuis",
        "type": "FLOAT",
        "description": "The average Thuisbezorgd amount by the total amount of Thuisbezorgd transactions by the number of Thuisbezorgd orders done on that particular date."
    },
    {
        "name": "avg_total",
        "type": "FLOAT",
        "description": "The average turnover amount by dividing the total turnover by the amount of transactions (sum of cash, pin, iDEAL, and Thuisbezorgd) done on that particular date."
    },
    {
        "name": "%N_pin",
        "type": "FLOAT",
        "description": "Percentage pin cases by the total cases multiplied by 100 on that particular date."
    },
    {
        "name": "%N_cash",
        "type": "FLOAT",
        "description": "Percentage cash cases by the total cases multiplied by 100 on that particular date."
    },
    {
        "name": "%N_ideal",
        "type": "FLOAT",
        "description": "Percentage iDEAL cases by the total cases multiplied by 100 on that particular date."
    },
    {
        "name": "%N_thuis",
        "type": "FLOAT",
        "description": "Percentage of Thuisbezorgd cases by the total cases multiplied by 100 on that particular date."
    },
    {
        "name": "%am_pin",
        "type": "FLOAT",
        "description": "Percentage pin transactions by the total turnover multiplied by 100 on that particular date."
    },
    {
        "name": "%am_cash",
        "type": "FLOAT",
        "description": "Percentage cash transactions by the total turnover multiplied by 100 on that particular date."
    },
    {
        "name": "%am_ideal",
        "type": "FLOAT",
        "description": "Percentage iDEAL transactions by the total turnover multiplied by 100 on that particular date."
    },
    {
        "name": "%am_thuis",
        "type": "FLOAT",
        "description": "Percentage of Thuisbezorgd transactions by the total turnover multiplied by 100 on that particular date."
    },
    {
        "name": "temp",
        "type": "FLOAT",
        "description": "The temperature of the particular date in Leiden (source: Weerlive API)."
    },
    {
        "name": "sun%",
        "type": "INTEGER",
        "description": "The sun percentage on the particular date in Leiden (source: Weerlive API)."
    },
    {
        "name": "rain%",
        "type": "INTEGER",
        "description": "The percentage of rain on a particular date in Leiden (source: Weerlive API)."
    },
    {
        "name": "windbft",
        "type": "INTEGER",
        "description": "The wind force on the particular date in Leiden (source: Weerlive API)."
    },
    {
        "name": "day",
        "type": "STRING",
        "description": "The day of the date in string format (e.g. Monday)."
    },
    {
        "name": "week_n",
        "type": "INTEGER",
        "description": "The number of the week of that particular date in integer format (e.g. week 52)."
    },
    {
        "name": "month",
        "type": "STRING",
        "description": "The month of the date in string format (e.g. January)."
    },
    {
        "name": "dayOfMonth",
        "type": "INTEGER",
        "description": "The day of the month in integer format (e.g. 1, 2, …, 30/31)."
    },
    {
        "name": "dateForm",
        "type": "STRING",
        "description": "The legacy date column comes from the Google Sheet source."
    },
    {
        "name": "Comm",
        "type": "STRING",
        "description": "Additional comments to provide context on what kind of event occurred on that day (e.g. Leidens Ontzet)."
    }
]